finer/system/controlDict:Zone.Identifier
[ZoneTransfer]
ZoneId=3
ReferrerUrl=C:\Users\HP\Desktop\SHK_Andre\simulation_setup (1).tar.gz
