finer/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       479616;
    }
    inletvalve
    {
        type            patch;
        nFaces          10240;
        startFace       479776;
    }
    outlet
    {
        type            patch;
        nFaces          160;
        startFace       490016;
    }
    slip
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1600;
        startFace       490176;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1408;
        startFace       491776;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          471040;
        startFace       493184;
    }
)

// ************************************************************************* //
